# -*- ii: y; -*-
#+TITLE: tmate.kubemacs.org config

* aoeu
#+begin_src shell
kubectl get all
#+end_src

#+RESULTS:
#+begin_example
NAME                            READY   STATUS    RESTARTS   AGE
pod/kubemacs-0                  1/1     Running   0          10h
pod/master-7f96dfc6fd-wnv4k     1/1     Running   0          90m
pod/postgres-557b47554f-nzxcq   1/1     Running   0          90m
pod/session-77d4c66655-cdsk6    2/2     Running   0          90m

NAME                    TYPE        CLUSTER-IP      EXTERNAL-IP   PORT(S)             AGE
service/kubemacs-tilt   ClusterIP   10.96.168.49    <none>        10350/TCP           10h
service/master          ClusterIP   10.96.135.248   <none>        4000/TCP,9100/TCP   90m
service/postgres        ClusterIP   10.96.32.198    <none>        5432/TCP            90m
service/session         ClusterIP   10.96.194.190   <none>        2200/TCP,4001/TCP   90m

NAME                       READY   UP-TO-DATE   AVAILABLE   AGE
deployment.apps/master     1/1     1            1           90m
deployment.apps/postgres   1/1     1            1           90m
deployment.apps/session    1/1     1            1           90m

NAME                                  DESIRED   CURRENT   READY   AGE
replicaset.apps/master-7f96dfc6fd     1         1         1       90m
replicaset.apps/postgres-557b47554f   1         1         1       90m
replicaset.apps/session-77d4c66655    1         1         1       90m

NAME                        READY   AGE
statefulset.apps/kubemacs   1/1     10h
#+end_example

* exploring the tmate deployment

  #+begin_src shell
    lsof -i -n -P 2>&1
    :
  #+end_src

  #+RESULTS:
  #+begin_example
  COMMAND   PID USER   FD   TYPE     DEVICE SIZE/OFF NODE NAME
  tmate      95   ii    6u  IPv4 2625393319      0t0  TCP 10.244.1.2:47424->157.230.72.130:22 (ESTABLISHED)
  tmate     147   ii   11u  IPv4 2625297131      0t0  TCP 10.244.1.2:47686->157.230.72.130:22 (ESTABLISHED)
  tilt    44945   ii    5u  IPv4 2627038037      0t0  TCP 10.244.1.2:56870->10.96.0.1:443 (ESTABLISHED)
  tilt    44945   ii   17u  IPv6 2627093567      0t0  TCP *:10350 (LISTEN)
  #+end_example

* mix command
#+begin_src shell :dir "."
kubectl exec -it deploy/master mix do ecto.create, ecto.migrate
#+end_src

#+RESULTS:
#+begin_example
The database for Tmate.Repo has already been created

16:34:01.463 [info]  Already up
#+end_example
